; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	thermograph3 - mode
	GroundStation4 - direction
	GroundStation5 - direction
	Star9 - direction
	Star10 - direction
	GroundStation14 - direction
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star11 - direction
	GroundStation3 - direction
	GroundStation8 - direction
	GroundStation12 - direction
	Star6 - direction
	GroundStation7 - direction
	Star13 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Planet20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star21)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation8)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet19)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star13)
	(calibration_target instrument2 Star11)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument3 thermograph3)
	(supports instrument3 image1)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation12)
	(calibration_target instrument3 GroundStation8)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
)
(:goal (and
	(have_image Phenomenon15 thermograph2)
	(have_image Phenomenon16 thermograph3)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 thermograph0)
	(have_image Planet19 thermograph3)
	(have_image Planet20 thermograph3)
	(have_image Star21 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation12 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 groundstation12)
   goals met: 0 of 7
2. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite3 instrument3 groundstation12)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite3 planet19 groundstation12)
   deleted: (pointing satellite3 groundstation12)
   added: (pointing satellite3 planet19)
   goals met: 0 of 7
5. (take_image satellite3 planet19 instrument3 thermograph3)
   added: (have_image planet19 thermograph3)
   goals met: 1 of 7
6. (turn_to satellite3 phenomenon16 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 phenomenon16)
   goals met: 1 of 7
7. (turn_to satellite0 star0 star21)
   deleted: (pointing satellite0 star21)
   added: (pointing satellite0 star0)
   goals met: 1 of 7
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
9. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 1 of 7
10. (take_image satellite3 phenomenon16 instrument3 thermograph3)
   added: (have_image phenomenon16 thermograph3)
   goals met: 2 of 7
11. (turn_to satellite0 phenomenon15 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 7
12. (take_image satellite0 phenomenon15 instrument0 thermograph2)
   added: (have_image phenomenon15 thermograph2)
   goals met: 3 of 7
13. (turn_to satellite0 phenomenon17 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 7
14. (take_image satellite0 phenomenon17 instrument0 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 4 of 7
15. (turn_to satellite0 planet18 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet18)
   goals met: 4 of 7
16. (take_image satellite0 planet18 instrument0 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 5 of 7
17. (turn_to satellite0 star21 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star21)
   goals met: 5 of 7
18. (take_image satellite0 star21 instrument0 thermograph0)
   added: (have_image star21 thermograph0)
   goals met: 6 of 7
19. (turn_to satellite3 planet20 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 planet20)
   goals met: 6 of 7
20. (take_image satellite3 planet20 instrument3 thermograph3)
   added: (have_image planet20 thermograph3)
   goals met: 7 of 7
